node {
  name: "global_step/Initializer/zeros/shape_as_tensor"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "global_step/Initializer/zeros/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step/Initializer/zeros"
  op: "Fill"
  input: "global_step/Initializer/zeros/shape_as_tensor"
  input: "global_step/Initializer/zeros/Const"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/IsVariableInitialized"
  op: "IsVariableInitialized"
  input: "global_step"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "global_step/cond/Switch"
  op: "Switch"
  input: "global_step/IsVariableInitialized"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_t"
  op: "Identity"
  input: "global_step/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_f"
  op: "Identity"
  input: "global_step/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/pred_id"
  op: "Identity"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read"
  op: "Identity"
  input: "global_step/cond/read/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read/Switch"
  op: "RefSwitch"
  input: "global_step"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Switch_1"
  op: "Switch"
  input: "global_step/Initializer/zeros"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Merge"
  op: "Merge"
  input: "global_step/cond/Switch_1"
  input: "global_step/cond/read"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/add/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step/add"
  op: "Add"
  input: "global_step/cond/Merge"
  input: "global_step/add/y"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "tensors/component_0"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 120
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 120
          }
        }
        tensor_content: "ffffff\030@ffffff\030@333333\031@ffffff\022@\315\314\314\314\314\314\024@\315\314\314\314\314\314\022@\315\314\314\314\314\314\024@\000\000\000\000\000\000\024@\315\314\314\314\314\314\026@\315\314\314\314\314\314\036@333333\027@\232\231\231\231\231\231\021@\315\314\314\314\314\314\036@\232\231\231\231\231\231\027@\000\000\000\000\000\000\024@\315\314\314\314\314\314\026@333333\031@\000\000\000\000\000\000\024@\315\314\314\314\314\314\032@ffffff\026@\232\231\231\231\231\231\031@\000\000\000\000\000\000\032@\232\231\231\231\231\231\031@ffffff\030@\315\314\314\314\314\314\034@333333\025@333333\031@333333\027@ffffff\034@333333\023@ffffff\024@\315\314\314\314\314\314\030@\000\000\000\000\000\000\024@333333\031@\315\314\314\314\314\314\032@333333\023@\232\231\231\231\231\231\021@\232\231\231\231\231\231\025@ffffff\022@\000\000\000\000\000\000\024@\000\000\000\000\000\000\026@\315\314\314\314\314\314\030@\315\314\314\314\314\314\024@\232\231\231\231\231\231\033@\315\314\314\314\314\314\034@\232\231\231\231\231\231\023@333333\027@\315\314\314\314\314\314\032@\315\314\314\314\314\314\036@\315\314\314\314\314\314\032@\232\231\231\231\231\231\023@\000\000\000\000\000\000\032@ffffff\036@\315\314\314\314\314\314\030@\232\231\231\231\231\231\023@ffffff\026@ffffff\026@\232\231\231\231\231\231\033@ffffff\032@ffffff\024@ffffff\024@\232\231\231\231\231\231\035@\315\314\314\314\314\314\026@\000\000\000\000\000\000\032@ffffff\024@\000\000\000\000\000\000\026@ffffff\024@333333\031@\000\000\000\000\000\000\030@ffffff\030@\315\314\314\314\314\314\032@\315\314\314\314\314\314\026@\000\000\000\000\000\000\024@\232\231\231\231\231\231\031@\232\231\231\231\231\231\025@\232\231\231\231\231\231\037@\315\314\314\314\314\314\026@\000\000\000\000\000\000\030@ffffff\026@\232\231\231\231\231\231\025@333333\027@\000\000\000\000\000\000\024@\315\314\314\314\314\314\030@\232\231\231\231\231\231\031@\000\000\000\000\000\000\030@\000\000\000\000\000\000\030@\315\314\314\314\314\314\026@\000\000\000\000\000\000\024@\232\231\231\231\231\231\027@\000\000\000\000\000\000\030@\000\000\000\000\000\000\026@ffffff\024@\315\314\314\314\314\314\032@\000\000\000\000\000\000\032@\232\231\231\231\231\231\027@333333\031@333333\031@\000\000\000\000\000\000\022@\232\231\231\231\231\231\025@333333\023@\232\231\231\231\231\231\025@\000\000\000\000\000\000\026@\232\231\231\231\231\231\025@333333\027@\315\314\314\314\314\314\026@\232\231\231\231\231\231\031@333333\027@\315\314\314\314\314\314\026@333333\021@333333\031@\000\000\000\000\000\000\030@\315\314\314\314\314\314\024@ffffff\024@\232\231\231\231\231\231\033@\232\231\231\231\231\231\023@\000\000\000\000\000\000\024@ffffff\030@ffffff\026@333333\027@\000\000\000\000\000\000\026@"
      }
    }
  }
}
node {
  name: "tensors/component_1"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 120
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 120
          }
        }
        tensor_content: "\000\000\000\000\000\000\010@333333\007@333333\007@333333\013@\232\231\231\231\231\231\005@\232\231\231\231\231\231\t@\000\000\000\000\000\000\014@\232\231\231\231\231\231\t@ffffff\006@ffffff\006@\232\231\231\231\231\231\005@\232\231\231\231\231\231\t@ffffff\016@\000\000\000\000\000\000\010@\000\000\000\000\000\000\014@\315\314\314\314\314\314\004@ffffff\n@\000\000\000\000\000\000\010@\000\000\000\000\000\000\004@\232\231\231\231\231\231\005@333333\007@ffffff\006@\232\231\231\231\231\231\t@ffffff\006@\315\314\314\314\314\314\014@\232\231\231\231\231\231\r@\232\231\231\231\231\231\005@\315\314\314\314\314\314\004@\000\000\000\000\000\000\010@333333\013@\000\000\000\000\000\000\004@ffffff\006@\000\000\000\000\000\000\014@ffffff\006@\000\000\000\000\000\000\010@333333\013@333333\007@333333\013@\315\314\314\314\314\314\014@ffffff\002@\000\000\000\000\000\000\014@\232\231\231\231\231\231\001@ffffff\020@\315\314\314\314\314\314\010@\232\231\231\231\231\231\t@\315\314\314\314\314\314\010@ffffff\006@\000\000\000\000\000\000\010@\000\000\000\000\000\000\010@\315\314\314\314\314\314\010@\000\000\000\000\000\000\010@\000\000\000\000\000\000\010@\000\000\000\000\000\000\010@333333\007@333333\003@333333\007@\000\000\000\000\000\000\010@\315\314\314\314\314\314\010@333333\007@\000\000\000\000\000\000\014@333333\013@ffffff\006@\000\000\000\000\000\000\004@\232\231\231\231\231\231\t@\232\231\231\231\231\231\r@\315\314\314\314\314\314\020@\000\000\000\000\000\000\014@\000\000\000\000\000\000\004@\232\231\231\231\231\231\001@\315\314\314\314\314\314\004@ffffff\n@ffffff\006@\315\314\314\314\314\314\014@\232\231\231\231\231\231\005@\232\231\231\231\231\231\r@ffffff\016@\232\231\231\231\231\231\021@333333\007@\000\000\000\000\000\000\010@333333\017@\232\231\231\231\231\231\005@333333\013@333333\013@ffffff\006@\000\000\000\000\000\000\010@333333\013@ffffff\016@ffffff\n@\000\000\000\000\000\000\010@\232\231\231\231\231\231\005@\315\314\314\314\314\314\004@ffffff\016@\315\314\314\314\314\314\010@\000\000\000\000\000\000\010@\232\231\231\231\231\231\t@ffffff\n@\000\000\000\000\000\000\004@ffffff\002@333333\017@\000\000\000\000\000\000\010@\000\000\000\000\000\000\010@\000\000\000\000\000\000\004@333333\013@\232\231\231\231\231\231\005@\000\000\000\000\000\000\010@\315\314\314\314\314\314\010@\232\231\231\231\231\231\005@333333\007@\000\000\000\000\000\000\010@ffffff\002@\232\231\231\231\231\231\001@333333\013@ffffff\016@\315\314\314\314\314\314\010@\000\000\000\000\000\000\004@\000\000\000\000\000\000\000@ffffff\006@ffffff\006@\000\000\000\000\000\000\020@333333\003@"
      }
    }
  }
}
node {
  name: "tensors/component_2"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 120
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 120
          }
        }
        tensor_content: "ffffff\022@\315\314\314\314\314\314\022@ffffff\026@ffffff\366?333333\017@\232\231\231\231\231\231\371?\000\000\000\000\000\000\370?333333\363?ffffff\020@\315\314\314\314\314\314\032@333333\017@\315\314\314\314\314\314\364?\315\314\314\314\314\314\032@\315\314\314\314\314\314\020@\232\231\231\231\231\231\371?\000\000\000\000\000\000\014@\000\000\000\000\000\000\030@\232\231\231\231\231\231\371?333333\027@\315\314\314\314\314\314\020@333333\021@ffffff\022@\000\000\000\000\000\000\022@\315\314\314\314\314\314\022@ffffff\030@\000\000\000\000\000\000\370?\232\231\231\231\231\231\023@\000\000\000\000\000\000\020@\232\231\231\231\231\231\027@\232\231\231\231\231\231\371?\000\000\000\000\000\000\010@333333\023@\315\314\314\314\314\314\364?ffffff\024@\000\000\000\000\000\000\024@ffffff\376?ffffff\366?433333\373?\000\000\000\000\000\000\360?ffffff\n@\315\314\314\314\314\314\364?\000\000\000\000\000\000\022@\000\000\000\000\000\000\370?ffffff\024@\000\000\000\000\000\000\030@\000\000\000\000\000\000\370?ffffff\024@\315\314\314\314\314\314\024@ffffff\030@ffffff\026@ffffff\366?\315\314\314\314\314\314\024@ffffff\032@333333\021@ffffff\n@\315\314\314\314\314\314\014@\000\000\000\000\000\000\022@\232\231\231\231\231\231\023@ffffff\022@ffffff\366?\000\000\000\000\000\000\370?ffffff\030@\000\000\000\000\000\000\024@ffffff\024@\000\000\000\000\000\000\370?ffffff\366?ffffff\366?\000\000\000\000\000\000\024@\000\000\000\000\000\000\020@ffffff\026@\315\314\314\314\314\314\026@\000\000\000\000\000\000\022@ffffff\366?333333\025@\000\000\000\000\000\000\370?\232\231\231\231\231\231\031@\000\000\000\000\000\000\370?\000\000\000\000\000\000\022@ffffff\020@433333\373?ffffff\020@\000\000\000\000\000\000\370?\232\231\231\231\231\231\025@ffffff\026@333333\023@\000\000\000\000\000\000\022@433333\373?ffffff\366?ffffff\024@ffffff\024@\232\231\231\231\231\231\021@ffffff\376?\315\314\314\314\314\314\022@333333\027@333333\023@\315\314\314\314\314\314\022@\232\231\231\231\231\231\023@\315\314\314\314\314\314\364?\315\314\314\314\314\314\364?ffffff\366?\000\000\000\000\000\000\022@\000\000\000\000\000\000\020@\000\000\000\000\000\000\370?ffffff\024@\315\314\314\314\314\314\020@\000\000\000\000\000\000\026@ffffff\024@\315\314\314\314\314\314\020@\232\231\231\231\231\231\361?\232\231\231\231\231\231\021@\000\000\000\000\000\000\024@ffffff\366?\232\231\231\231\231\231\371?\232\231\231\231\231\231\025@\000\000\000\000\000\000\022@\000\000\000\000\000\000\014@\000\000\000\000\000\000\020@\232\231\231\231\231\231\023@333333\363?\232\231\231\231\231\231\r@"
      }
    }
  }
}
node {
  name: "tensors/component_3"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 120
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 120
          }
        }
        tensor_content: "ffffff\366?ffffff\366?\315\314\314\314\314\314\374?433333\323?ffffff\366?\232\231\231\231\231\231\311?\232\231\231\231\231\231\311?\232\231\231\231\231\231\311?\315\314\314\314\314\314\364?\000\000\000\000\000\000\000@333333\363?\232\231\231\231\231\231\311?\232\231\231\231\231\231\001@\000\000\000\000\000\000\370?433333\343?\000\000\000\000\000\000\360?\000\000\000\000\000\000\004@\232\231\231\231\231\231\311?\315\314\314\314\314\314\374?\315\314\314\314\314\314\364?\315\314\314\314\314\314\364?\000\000\000\000\000\000\370?\000\000\000\000\000\000\370?333333\363?\000\000\000\000\000\000\004@\232\231\231\231\231\231\311?\315\314\314\314\314\314\374?333333\363?\315\314\314\314\314\314\000@\232\231\231\231\231\231\311?\232\231\231\231\231\231\361?\315\314\314\314\314\314\374?433333\323?\000\000\000\000\000\000\370?433333\373?\232\231\231\231\231\231\311?\232\231\231\231\231\231\311?\232\231\231\231\231\231\311?\232\231\231\231\231\231\311?\000\000\000\000\000\000\360?\232\231\231\231\231\231\311?\000\000\000\000\000\000\370?\232\231\231\231\231\231\271?ffffff\002@\315\314\314\314\314\314\374?\232\231\231\231\231\231\271?333333\003@ffffff\002@ffffff\002@333333\003@\232\231\231\231\231\231\311?\000\000\000\000\000\000\000@\315\314\314\314\314\314\000@\315\314\314\314\314\314\364?\000\000\000\000\000\000\360?\315\314\314\314\314\314\364?\000\000\000\000\000\000\370?\000\000\000\000\000\000\370?\315\314\314\314\314\314\364?433333\323?\232\231\231\231\231\231\311?ffffff\376?\000\000\000\000\000\000\000@\000\000\000\000\000\000\000@\232\231\231\231\231\231\331?\232\231\231\231\231\231\311?\232\231\231\231\231\231\311?ffffff\376?\000\000\000\000\000\000\360?ffffff\366?\000\000\000\000\000\000\004@\315\314\314\314\314\314\364?\232\231\231\231\231\231\311?ffffff\376?\232\231\231\231\231\231\311?\000\000\000\000\000\000\000@\232\231\231\231\231\231\331?\000\000\000\000\000\000\370?\315\314\314\314\314\314\364?\232\231\231\231\231\231\331?\000\000\000\000\000\000\360?\232\231\231\231\231\231\311?ffffff\002@\232\231\231\231\231\231\001@\315\314\314\314\314\314\374?\232\231\231\231\231\231\371?433333\323?\232\231\231\231\231\231\311?\315\314\314\314\314\314\374?\232\231\231\231\231\231\371?333333\363?\232\231\231\231\231\231\331?\000\000\000\000\000\000\370?\232\231\231\231\231\231\001@\315\314\314\314\314\314\374?\232\231\231\231\231\231\371?\000\000\000\000\000\000\370?433333\323?\232\231\231\231\231\231\331?433333\323?\000\000\000\000\000\000\370?\315\314\314\314\314\314\364?\232\231\231\231\231\231\331?ffffff\376?333333\363?\315\314\314\314\314\314\374?ffffff\376?\315\314\314\314\314\314\364?\232\231\231\231\231\231\271?\315\314\314\314\314\314\364?\000\000\000\000\000\000\370?\232\231\231\231\231\231\311?\232\231\231\231\231\231\311?\315\314\314\314\314\314\000@433333\373?\000\000\000\000\000\000\360?\315\314\314\314\314\314\364?\000\000\000\000\000\000\000@\232\231\231\231\231\231\311?\000\000\000\000\000\000\360?"
      }
    }
  }
}
node {
  name: "tensors/component_4"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 120
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 120
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\002\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\001\000\000\000\001\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\001\000\000\000\002\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\002\000\000\000\001\000\000\000\002\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\002\000\000\000\001\000\000\000\002\000\000\000\000\000\000\000\002\000\000\000\001\000\000\000\000\000\000\000\002\000\000\000\001\000\000\000\002\000\000\000\000\000\000\000\001\000\000\000\001\000\000\000\001\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\002\000\000\000\002\000\000\000\001\000\000\000\002\000\000\000\002\000\000\000\002\000\000\000\002\000\000\000\001\000\000\000\002\000\000\000\002\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\001\000\000\000\002\000\000\000\002\000\000\000\002\000\000\000\001\000\000\000\001\000\000\000\001\000\000\000\002\000\000\000\000\000\000\000\002\000\000\000\002\000\000\000\000\000\000\000\001\000\000\000\002\000\000\000\001\000\000\000\002\000\000\000\001\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\002\000\000\000\002\000\000\000\002\000\000\000\000\000\000\000\001\000\000\000\001\000\000\000\002\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\001\000\000\000\001\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\002\000\000\000\000\000\000\000\002\000\000\000\002\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\002\000\000\000\001\000\000\000\001\000\000\000\002\000\000\000\002\000\000\000\000\000\000\000\000\000\000\000\002\000\000\000\001\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "count"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: -1
      }
    }
  }
}
node {
  name: "batch_size"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 10
      }
    }
  }
}
node {
  name: "Iterator"
  op: "Iterator"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_INT32
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "TensorSliceDataset"
  op: "TensorSliceDataset"
  input: "tensors/component_0"
  input: "tensors/component_1"
  input: "tensors/component_2"
  input: "tensors/component_3"
  input: "tensors/component_4"
  attr {
    key: "Toutput_types"
    value {
      list {
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_INT32
      }
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Iterator"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "RepeatDataset"
  op: "RepeatDataset"
  input: "TensorSliceDataset"
  input: "count"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Iterator"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_INT32
      }
    }
  }
}
node {
  name: "BatchDataset"
  op: "BatchDataset"
  input: "RepeatDataset"
  input: "batch_size"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Iterator"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_INT32
      }
    }
  }
}
node {
  name: "MakeIterator"
  op: "MakeIterator"
  input: "BatchDataset"
  input: "Iterator"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Iterator"
      }
    }
  }
}
node {
  name: "IteratorToStringHandle"
  op: "IteratorToStringHandle"
  input: "Iterator"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "IteratorGetNext"
  op: "IteratorGetNext"
  input: "Iterator"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_INT32
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/0/ExpandDims/dim"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/0/ExpandDims"
  op: "ExpandDims"
  input: "IteratorGetNext"
  input: "dnn/input_from_feature_columns/input_layer/0/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/0/ToFloat"
  op: "Cast"
  input: "dnn/input_from_feature_columns/input_layer/0/ExpandDims"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/0/Shape"
  op: "Shape"
  input: "dnn/input_from_feature_columns/input_layer/0/ToFloat"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/0/strided_slice/stack"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/0/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/0/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/0/strided_slice"
  op: "StridedSlice"
  input: "dnn/input_from_feature_columns/input_layer/0/Shape"
  input: "dnn/input_from_feature_columns/input_layer/0/strided_slice/stack"
  input: "dnn/input_from_feature_columns/input_layer/0/strided_slice/stack_1"
  input: "dnn/input_from_feature_columns/input_layer/0/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/0/Reshape/shape/1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/0/Reshape/shape"
  op: "Pack"
  input: "dnn/input_from_feature_columns/input_layer/0/strided_slice"
  input: "dnn/input_from_feature_columns/input_layer/0/Reshape/shape/1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/0/Reshape"
  op: "Reshape"
  input: "dnn/input_from_feature_columns/input_layer/0/ToFloat"
  input: "dnn/input_from_feature_columns/input_layer/0/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/1/ExpandDims/dim"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/1/ExpandDims"
  op: "ExpandDims"
  input: "IteratorGetNext:1"
  input: "dnn/input_from_feature_columns/input_layer/1/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/1/ToFloat"
  op: "Cast"
  input: "dnn/input_from_feature_columns/input_layer/1/ExpandDims"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/1/Shape"
  op: "Shape"
  input: "dnn/input_from_feature_columns/input_layer/1/ToFloat"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/1/strided_slice/stack"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/1/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/1/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/1/strided_slice"
  op: "StridedSlice"
  input: "dnn/input_from_feature_columns/input_layer/1/Shape"
  input: "dnn/input_from_feature_columns/input_layer/1/strided_slice/stack"
  input: "dnn/input_from_feature_columns/input_layer/1/strided_slice/stack_1"
  input: "dnn/input_from_feature_columns/input_layer/1/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/1/Reshape/shape/1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/1/Reshape/shape"
  op: "Pack"
  input: "dnn/input_from_feature_columns/input_layer/1/strided_slice"
  input: "dnn/input_from_feature_columns/input_layer/1/Reshape/shape/1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/1/Reshape"
  op: "Reshape"
  input: "dnn/input_from_feature_columns/input_layer/1/ToFloat"
  input: "dnn/input_from_feature_columns/input_layer/1/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/2/ExpandDims/dim"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/2/ExpandDims"
  op: "ExpandDims"
  input: "IteratorGetNext:2"
  input: "dnn/input_from_feature_columns/input_layer/2/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/2/ToFloat"
  op: "Cast"
  input: "dnn/input_from_feature_columns/input_layer/2/ExpandDims"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/2/Shape"
  op: "Shape"
  input: "dnn/input_from_feature_columns/input_layer/2/ToFloat"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/2/strided_slice/stack"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/2/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/2/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/2/strided_slice"
  op: "StridedSlice"
  input: "dnn/input_from_feature_columns/input_layer/2/Shape"
  input: "dnn/input_from_feature_columns/input_layer/2/strided_slice/stack"
  input: "dnn/input_from_feature_columns/input_layer/2/strided_slice/stack_1"
  input: "dnn/input_from_feature_columns/input_layer/2/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/2/Reshape/shape/1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/2/Reshape/shape"
  op: "Pack"
  input: "dnn/input_from_feature_columns/input_layer/2/strided_slice"
  input: "dnn/input_from_feature_columns/input_layer/2/Reshape/shape/1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/2/Reshape"
  op: "Reshape"
  input: "dnn/input_from_feature_columns/input_layer/2/ToFloat"
  input: "dnn/input_from_feature_columns/input_layer/2/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/3/ExpandDims/dim"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/3/ExpandDims"
  op: "ExpandDims"
  input: "IteratorGetNext:3"
  input: "dnn/input_from_feature_columns/input_layer/3/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/3/ToFloat"
  op: "Cast"
  input: "dnn/input_from_feature_columns/input_layer/3/ExpandDims"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/3/Shape"
  op: "Shape"
  input: "dnn/input_from_feature_columns/input_layer/3/ToFloat"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/3/strided_slice/stack"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/3/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/3/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/3/strided_slice"
  op: "StridedSlice"
  input: "dnn/input_from_feature_columns/input_layer/3/Shape"
  input: "dnn/input_from_feature_columns/input_layer/3/strided_slice/stack"
  input: "dnn/input_from_feature_columns/input_layer/3/strided_slice/stack_1"
  input: "dnn/input_from_feature_columns/input_layer/3/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/3/Reshape/shape/1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
